# Creating the language training center  Data base in MYSQL using Python

In [24]:
#Import Libries to connect to MySQL
import mysql.connector
from mysql.connector import Error

In [25]:
#Creating a variable conn and seetting up the connection
conn = mysql.connector.connect(user='', password='', host='')# add your user,password and host between''
conn

In [26]:
#Storing the connection in variable cursor using object conn
cursor = conn.cursor()
cursor.execute("Drop Database if exists Pvjxm17_dCenter")
#Drop Database Pvjxm17_dCenter

In [27]:
#Creating the Database
cursor.execute("Create Database Pvjxm17_dCenter")

In [28]:
#Using the Database
cursor.execute("USE Pvjxm17_dCenter")

### Table 1 : Creating Table Enrolment and inserting values

In [29]:
cursor.execute("DROP TABLE IF EXISTS Enrolment")
Create_Table_Enrolment = "CREATE Table Enrolment(Enroll_ID INT PRIMARY KEY,Teacher_ID INT, Stu_ID INT, Language_ID Varchar(5),Department varchar(20));"
cursor.execute(Create_Table_Enrolment)
conn.commit()

In [30]:
try:
    Inser_Values_Enrolment = "INSERT Into Enrolment Values(101, 675, 189, 'SAN01', 'Reasearch Language'),(102, 234, 565, 'ENG03', 'Communication'),(103, 234, 190, 'ENG01', 'Communication'),(201, 234, 189, 'ENG03', 'Communication'),(202, 675, 565, 'SAN01', 'Reasearch Language'),(203, 234, 566, 'ENG01', 'Communication');"
    for insert_query in Inser_Values_Enrolment:
        cursor.execute(Inser_Values_Enrolment)
# Commit the changes    
    conn.commit()
except Error as error:
    print("")

In [31]:
# Execute the SELECT query
cursor.execute("SELECT * FROM Enrolment")
# Fetch all the results
results = cursor.fetchall()
# Print the result
for result in results:
    print(result)

(101, 675, 189, 'SAN01', 'Reasearch Language')
(102, 234, 565, 'ENG03', 'Communication')
(103, 234, 190, 'ENG01', 'Communication')
(201, 234, 189, 'ENG03', 'Communication')
(202, 675, 565, 'SAN01', 'Reasearch Language')
(203, 234, 566, 'ENG01', 'Communication')

### Table 2 : Creating Table Teacher and inserting values

In [32]:
cursor.execute("DROP TABLE IF EXISTS Teacher")
Create_Table_Teacher = "CREATE Table Teacher(Teacher_ID INT PRIMARY KEY, Teacher_First_Name varchar(30), Teacher_Last_Name varchar(30), Teacher_PhNo INT,Teacher_Salary INT, Enroll_ID INT NOT NULL, FOREIGN KEY (Enroll_ID) REFERENCES Enrolment(Enroll_ID));"

cursor.execute(Create_Table_Teacher)
conn.commit()

In [33]:
try:
    Inser_Values_Teacher = "INSERT Into Teacher Values(675, 'Amelia','Rosie', 74201197,30000, 101),(234, 'Emma','Amber', 82301197,40000, 102);"
    
    for insert_query in Inser_Values_Teacher:
        cursor.execute(Inser_Values_Teacher)
# Commit the changes    
    conn.commit()
except Error as error:
    print("")

In [34]:
# Execute the SELECT query
cursor.execute("SELECT * FROM Teacher;")
# Fetch all the results
results = cursor.fetchall()
# Print the result
for result in results:
    print(result)

(234, 'Emma', 'Amber', 82301197, 40000, 102)
(675, 'Amelia', 'Rosie', 74201197, 30000, 101)

### Table 3 : Creating Table Student and inserting values

In [35]:
cursor.execute("DROP TABLE IF EXISTS Student")
Create_Table_Student = "CREATE Table Student(Stu_ID INT PRIMARY KEY, Stu_First_Name Varchar(30), Stu_Last_Name varchar(30), Stu_PhNo INT, Enroll_ID INT NOT NULL, Fee_Balance INT, FOREIGN KEY (Enroll_ID) REFERENCES Enrolment(Enroll_ID));"

cursor.execute(Create_Table_Student)
conn.commit()

In [36]:
try:
    Inser_Values_Student = "INSERT Into Student Values(189, 'Adam','Joe', 71454397, 201, 0 ),(565, 'Robby','Noah',23014565, 202,50);"
    for insert_query in Inser_Values_Student:
        cursor.execute(Inser_Values_Student)
# Commit the changes    
    conn.commit()
except Error as error:
    print("")

In [37]:
# Execute the SELECT query
cursor.execute("SELECT * FROM Student")
# Fetch all the results
results = cursor.fetchall()
# Print the result
for result in results:
    print(result)

(189, 'Adam', 'Joe', 71454397, 201, 0)
(565, 'Robby', 'Noah', 23014565, 202, 50)

### Table 4 : Creating Table Language and inserting values

In [38]:
cursor.execute("DROP TABLE IF EXISTS Language")
Create_Table_Language = "CREATE Table Language(Language_ID varchar(5) PRIMARY KEY,Teacher_ID INT, Language_Level Varchar(30), Language_Name Varchar(30), Mode_Of_Delivery Varchar(20), Duration_In_Months INT,FOREIGN KEY (Teacher_ID) REFERENCES Teacher(Teacher_ID));"

cursor.execute(Create_Table_Language)
conn.commit()

In [39]:
try:
    Inser_Values_Language = "INSERT Into Language Values('SAN01',675,'Beginner','Sanskrit','Online',6),('ENG01',234,'Advance','English','Classroom',12);"
    for insert_query in Inser_Values_Language:
        cursor.execute(Inser_Values_Language)
    # Commit the changes    
    conn.commit()
except Error as error:
    print("")

In [40]:
# Execute the SELECT query
cursor.execute("SELECT * FROM Language")
# Fetch all the results
results = cursor.fetchall()
# Print the result
for result in results:
    print(result)

('ENG01', 234, 'Advance', 'English', 'Classroom', 12)
('SAN01', 675, 'Beginner', 'Sanskrit', 'Online', 6)

### Table 5 : Creating Table Class_Room and inserting values

In [41]:
cursor.execute("DROP TABLE IF EXISTS Class_Room")
Create_Table_Class_Room = "CREATE Table Class_Room(Room_No Varchar(3) PRIMARY KEY,Language_ID varchar(5), Room_Type Varchar(10), Capacity Varchar(30), FOREIGN KEY (Language_ID) REFERENCES Language(Language_ID));"

cursor.execute(Create_Table_Class_Room)
conn.commit()

In [42]:
try:
    Inser_Values_Class_Room = "INSERT Into Class_Room Values('A03','SAN01','Standard',100),('B01','ENG01','Ensuite',30);"
    for insert_query in Inser_Values_Class_Room:
        cursor.execute(Inser_Values_Class_Room)
# Commit the changes    
    conn.commit()
except Error as error:
    print("")

In [43]:
# Execute the SELECT query
cursor.execute("SELECT * FROM Class_Room")
# Fetch all the results
results = cursor.fetchall()
# Print the result
for result in results:
    print(result)

('A03', 'SAN01', 'Standard', '100')
('B01', 'ENG01', 'Ensuite', '30')

In [44]:
#Closing the connection
cursor.close()
cursor

### The END